app/controllers/admin_controller.rb

  def index
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1