app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => 'user_name')
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "user_name") VALUES(E'698579491017000.241256286639656', '2012-02-16 06:39:33.342771', '2012-02-16 06:39:33.342771', E'b7b7f65ae015e1a07b8515a3d42b5dd11ee5c55a', E'aaa') RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2012-02-15 14:00:36.957547', "hashed_password" = E'abaranji' WHERE "id" = 1